FILES/InformationRegisters/ОписаниеНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ОписаниеНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ШаблонОписания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НоменклатураБТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураБТ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасширенныйОтбор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементОтбора</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FILES/InformationRegisters/НастройкиСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>НастройкиСистемы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НаборХарактеристикСистемный</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НаборХарактеристикСистемный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FILES/InformationRegisters/ОписаниеНоменклатуры/Ext/ManagerModule.bsl
Функция ЗагрузитьПредопределенныеЗначения() Экспорт
	
	Макет = РегистрыСведений.ОписаниеНоменклатуры.ПолучитьМакет("ПредопределенныеЗначения");
	
	ТекущаяСтрока = 1;
	ВыполнятьЗагрузку = Истина;
	Пока ВыполнятьЗагрузку Цикл
		ТекущаяСтрока = ТекущаяСтрока + 1;
		
		НоменклатураБТ = Макет.Область(ТекущаяСтрока, 1, ТекущаяСтрока, 1).Текст;
		Наименование = Макет.Область(ТекущаяСтрока, 2, ТекущаяСтрока, 2).Текст;
		ШаблонОписания = Макет.Область(ТекущаяСтрока, 3, ТекущаяСтрока, 3).Текст;
		
		Если НоменклатураБТ = "" Тогда
			ВыполнятьЗагрузку = Ложь;
		Иначе
			Попытка
				Запрос = Новый Запрос; //Да-да запрос в цикле
				Запрос.УстановитьПараметр("Характеристика", ПланыВидовХарактеристик.НаборХарактеристикСистемный[НоменклатураБТ]);
				Запрос.Текст = "ВЫБРАТЬ
				               |	НастройкиСистемы.Характеристика КАК Характеристика,
				               |	НастройкиСистемы.Значение КАК Значение
				               |ИЗ
				               |	РегистрСведений.НастройкиСистемы КАК НастройкиСистемы
				               |ГДЕ
				               |	НастройкиСистемы.Характеристика = &Характеристика";
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					Если ЗначениеЗаполнено(Выборка.Значение) Тогда
						МЗ = РегистрыСведений.ОписаниеНоменклатуры.СоздатьМенеджерЗаписи();
						МЗ.Период = НачалоГода(ТекущаяДата());
						МЗ.НоменклатураБТ = Выборка.Значение;
						МЗ.ШаблонОписания = ШаблонОписания;
						МЗ.Записать(Истина);
					КонецЕсли;
				КонецЕсли;
				
			Исключение
			КонецПопытки;
		КонецЕсли;
			
	КонецЦикла;
	
КонецФункции
